export default {
  translation: {
    elements: {
      title: 'RSS агрегатор',
      subtitle: 'Начните читать RSS сегодня! Это легко, это красиво.',
      inputPlaceholder: 'Ссылка RSS',
      submitButton: 'Добавить',
      example: 'Пример: ',
      previewBtn: 'Просмотр',
      feeds: 'Фиды',
      posts: 'Посты',
      modalLink: 'Читать полностью',
      modalDismiss: 'Закрыть',
    },
    statusMessages: {
      networkProblems: '🔴 Ошибка сети',
      invalidRSS: '🔴 Ресурс не содержит валидный RSS',
      successRSSLoad: '🟢 RSS успешно загружен',
      RSSExists: '🔴 RSS уже существует',
      invalidURL: '🔴 Ссылка должна быть валидным URL',
      required: '🔴 Не должно быть пустым',
      default: '🔴 Что-то пошло не так, пожалуйста перезагрузите страницу',
    },
  },
};
